
import LinearGradient from 'react-native-linear-gradient';
import { ImageBackground } from 'react-native';
import React, { Component } from "react";
import { Container, Header, Content, Icon, Accordion, Text, View } from "native-base";
const dataArray = [


  {
    title: "کھانے سے پہلے کی دعا", arabic: `بِسْمِ اللّٰہِ وَعَلٰی بَرَكَةِ اللّٰہِ`, urdu: `"میں نے الله کے نام کے ساتھ اور الله کی برکت پر کھانا شروع کیا"
  
  ۔`},
  {
    title: "کھانے کے بعد کی دعا", arabic: `الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مِنَ الْمُسْلِمِينَ`, urdu: `"اللہ عزوجل کا شکر ہے جس نے ہمیں کھلایا پلایا اور مسلمانوں میں سے بنایا۔"
  
  ۔`},
  {
    title: "سوتے وقت کی دعا", arabic: `اَللّٰھُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا`, urdu: `"الٰہی عزوجل میں تیرے نام پر مرتا ہوں اور جیتا ہوں۔"
  
  ۔`},
  {
    title: "نیند سے بیدار ہونے کی دعا", arabic: `الْحَمْدُ لِلّٰہِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ`, urdu: `"تمام تعریفیں اللہ عزوجل کے لئے جس نے ہمیں موت (نیند) کے بعد حیات (بیداری) عطا فرمائی اور ہمیں اسی طرف لوٹنا ہے"
  
  ۔`},
  {
    title: "گھر میں داخل ہوتے وقت کی دعا", arabic: `اَللّٰھُمَّ اِنِّیْ اَسْئَلُكَ خَیْرَالْمَوْلَجِ وَخَیْرَالْمَخْرَجِ`, urdu: `"اے اللہ عَزَّ وَجَلَّ ! میں تجھ سے داخل ہونے اور نکلنے کی جگہوں کی بھلائی طلب کرتا ہوں ۔"
  
  ۔`},
  {
    title: "گھر سے نکلتے وقت کی دعا", arabic: `بِسْمِ اللّٰہِ تَوَكَّلْتُ عَلَى اللّٰہِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰہِ`, urdu: `"اللہ عزوجل کے نام سے (گھر سے نکلتا ہوں) میں نے اللہ عزوجل پر بھروسہ کیا اللہ عزوجل کے بغیر نہ طاقت ہے (گناہوں سے بچنےکی) اور نہ وقت ہے (نیکیاں کرنے کی)۔"
  
  ۔`},
  {
    title: "مسجد میں داخل ہونے کی دعا", arabic: `اَللّٰهُمَّ افْتَحْ لِيْ اَبْوَابَ رَحْمَتِکَ`, urdu: `"اے اللہ! میرے لیے رحمت کے دروازے کھول دے۔"
  
  ۔`},
  {
    title: "مسجد سے نکلنے کی دعا", arabic: `اَللّٰهُمَّ اِنِّيْ اَسْاَلُکَ مِنْ فَضْلِکَ وَرَحْمَتِکَ`, urdu: `"اے اللہ! میں تجھ سے تیرا فضل اور تیری رحمت مانگتا ہوں۔"
  
  ۔`},
  {
    title: "سفر اور سواری کی دعا", arabic: `سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَـٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ`, urdu: `"اللہ عزوجل کا شکر ہے، پاک ہے وہ جس نے ہمارے لئے اس(سواری کو) مسخر کیا اور ہم اس کو فرمانبردار نہیں بنا سکتے تھے۔"
  
  ۔`},
  {
    title: "بازار میں داخل ہوتے وقت کی دعا", arabic: `لَا إِلٰهَ إِلَّا اللّٰہُ وَحْدَهٗ لَا شَرِيكَ لَهٗ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلٰی كُلِّ شَيْءٍ قَدِيرٍ`, urdu: `"اللہ عزوجل کے سوا کوئی معبود نہین، وہ یکتا ہے، اس کا کوئی شریک نہیں، اس کی بادشاہت ہے اور اسی کے لئے حمد ہے وہی جلاتا اور مارتا ہےوہ (ایسا) زندہ ہے جسے موت نہیں، تمام بھلائیاں اسی کے دست قدرت میں ہیں اور وہ ہر چیز پر قادر ہے۔"
  
  ۔`},
  {
    title: "آئنہ دیکھتے وقت کی دعا", arabic: `اَللّٰهُمَّ أَنْتَ حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي`, urdu: `"اللہ عزوجل تو نے میری صورت اچھی بنائی تو میری سیرت (اخلاق) بھی اچھی کردے۔"
  
  ۔`}, {
    title: "ملاقات کے وقت کی دعا", arabic: `اَلسَّلَامُ عَلَيْكُمُ - وَعَلَيْكُمُ السَّلَامُ`, urdu: `"تم پر سلامتی ہو۔ اور تم پر بھی سلامتی ہو۔"
  
  ۔`}, {
    title: "چھینک آنے کے وقت کی دعا", arabic: `اَلْحَمْدُ لِلّٰہِ`, urdu: `"تمام تعریفیں اللہ عزوجل کےلئے ہیں۔"
  
  ۔`}, {
    title: "چھینک آنے پر الحمد للہ کہنے والے کے لئے دعا", arabic: `اللہ عزوجل تجھ پر رحم کرے۔`, urdu: `"يَرْحَمُكَ اللّٰہُ"
  
  ۔`},
  {
    title: "مصیبت و پریشانی کے وقت کی دعا", arabic: `إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُوْن. اَللّٰهُمَّ أْجُرْنِيْ فِيْ مُصِيبَتِيْ وَاخْلُفْ لِيْ خَيْرا مِنْهَا`, urdu: `"يقینا ہم اللہ ہى كى ملكيت ہیں اور اسى كى طرف لوٹ كر جانے والے ہیں۔اے اللہ مجھے ميرے اس صدمے یا تكليف كا اجر دے اور بدلے ميں مجھے اس سے زيادہ بہتر دے۔(صحیح مسلم)"
  
  ۔`},
  {
    title: "لباس پہنتے وقت کی دعا", arabic: `الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ`, urdu: `"تمام خوبیاں اللہ عزوجل کے لئے جس نے مجھ کو یہ کپڑا پہنایا اور میری قوت و طاقت کے بغیر مجھ کو عطا فرمایا۔"
  
  ۔`},
  {
    title: "عیادت کرتے وقت کی دعا", arabic: `لَا بَأْسَ طَهُورٌ إِنْ شَآءَ اللّٰہُ`, urdu: `"کوئی حرج کی بات نہیں انشاء اللہ عزوجل یہ مرض گناہوں سے پاک کرنے والا ہے"
  
  ۔`},
  {
    title: "دودھ پینے کے بعد کی دعا", arabic: `اَللّٰهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ`, urdu: `"یا الٰہی عزوجل ہمارے لئے اس میں برکت دے اور ہمیں اس سے زیادہ عنایت فرما۔"
  
  ۔`},
  {
    title: "نیا چاند دیکھتے وقت کی دعا", arabic: `نیا چاند دیکھتے وقت کی دعا`, urdu: `"یا الٰہی عزوجل اس چاند کو ہم پر برکت کے ساتھ اور ایمان و سلامتی اور اسلام اور اس چیز کی توفیق کے ساتھ نکال جس سے تو راضی ہوتا ہے اور پسند کرتا ہے، (اے پہلی رات کے چاند) میرا اور تیرا رب اللہ عزوجل ہے۔"
  
  ۔`},
  // {
  //   title: "", arabic: ``, urdu: `""
  
  // ۔`},
]
export class Zakat extends Component {
  _renderHeader(item, expanded) {
    return (
<LinearGradient  colors={["#485563","#29323c"]} style={{
        flex: 1,
        flexDirection: "row",
        justifyContent: "flex-end",
        alignItems: "flex-end",
        alignContent: "flex-end",
        backgroundColor: "#A9DAD6",
        padding: 10,
        fontSize: 24,
        textAlign: "left",
        borderBottomWidth: 1,
        


      }} >
      {/* <View > */}

        <Text style={{ fontSize: 24,color:"white" }}>
          {" "}{item.title}
        </Text>

      {/* </View> */}
      </LinearGradient>
    );
  }
  _renderContent(item) {
    return (
      <View>
        <ImageBackground source={require('../images/background5.jpg')} style={{ width: '100%' }} resizeMode="cover">
          <Text
            style={{
              // backgroundColor: "red",
              padding: 20,
              // fontStyle: "italic",
              fontFamily: "bolder",
              color: "white",
              
              fontSize: 30,
              textAlign: "center",
            }}
          >
            {item.arabic}
          </Text>
          <Text
            style={{
              // backgroundColor: "green",
              padding: 10,
              textAlign: "center",
              fontSize: 20,
              color: "white"
            }}
          >
            {item.urdu}
          </Text>
        </ImageBackground>
      </View>

    );
  }
  render() {
    return (
      <>
        {/* <Header /> */}
        <Content style={{ backgroundColor: "white" }}>
          <Accordion
            dataArray={dataArray}
            animation={true}
            expanded={true}
            renderHeader={this._renderHeader}
            renderContent={this._renderContent}
            renderContent={this._renderContent}

          />
        </Content>
      </>
    );
  }
}
<br />